ARM-software/CMSIS-View/Examples/EventStatistic/RTE/Device/S32K344/startup_S32K344.c
/*---------------------------------------------------------------------------
 * Name:    startup_S32K344.c
 * Purpose: S32K344 CMSIS Core Device Startup File
 * Rev.:    1.0.0
 *---------------------------------------------------------------------------*/
/*
 * Copyright (c) 2021 Arm Limited or its affiliates. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "RTE_Components.h"             // Component selection
#include CMSIS_device_header
#include "memory_layout.h"

#ifndef __ALIAS
  #define __ALIAS(x) __attribute__ ((alias(x)))
#endif

/*----------------------------------------------------------------------------
  External References
 *----------------------------------------------------------------------------*/
extern uint32_t __INITIAL_SP;

extern __NO_RETURN void __PROGRAM_START(void);

/*----------------------------------------------------------------------------
  Internal References
 *----------------------------------------------------------------------------*/
            void Reset_Handler  (void) __WEAK;
__NO_RETURN void Reset_Handler_C(void) __WEAK;
            void Default_Handler(void) __WEAK;

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/
void RESERVED_Handler                             (void) __WEAK __ALIAS("Default_Handler");

/* Exceptions */
void NMI_Handler                                  (void) __WEAK __ALIAS("Default_Handler");
void HardFault_Handler                            (void) __WEAK;
void MemManage_Handler                            (void) __WEAK __ALIAS("Default_Handler");
void BusFault_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void UsageFault_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void SVC_Handler                                  (void) __WEAK __ALIAS("Default_Handler");
void DebugMon_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void PendSV_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void SysTick_Handler                              (void) __WEAK __ALIAS("Default_Handler");

  /* Interrupts */
void INT0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void INT1_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void INT2_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void INT3_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void DMATCD0_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD1_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD2_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD3_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD4_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD5_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD6_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD7_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD8_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD9_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void DMATCD10_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD11_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD12_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD13_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD14_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD15_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD16_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD17_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD18_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD19_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD20_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD21_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD22_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD23_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD24_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD25_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD26_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD27_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD28_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD29_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD30_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void DMATCD31_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void ERM_0_Handler                                (void) __WEAK __ALIAS("Default_Handler");
void ERM_1_Handler                                (void) __WEAK __ALIAS("Default_Handler");
void MCM_Handler                                  (void) __WEAK __ALIAS("Default_Handler");
void STM0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void STM1_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void SWT0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void CTI0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void FLASH_0_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void FLASH_1_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void FLASH_2_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void RGM_Handler                                  (void) __WEAK __ALIAS("Default_Handler");
void PMC_Handler                                  (void) __WEAK __ALIAS("Default_Handler");
void SIUL_0_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void SIUL_1_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void SIUL_2_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void SIUL_3_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void EMIOS0_0_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS0_1_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS0_2_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS0_3_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS0_4_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS0_5_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS1_0_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS1_1_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS1_2_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS1_3_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS1_4_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS1_5_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS2_0_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS2_1_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS2_2_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS2_3_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS2_4_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void EMIOS2_5_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void WKPU_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void CMU0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void CMU1_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void CMU2_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void BCTU_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void LCU0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void LCU1_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void PIT0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void PIT1_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void PIT2_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void RTC_Handler                                  (void) __WEAK __ALIAS("Default_Handler");
void EMAC_0_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void EMAC_1_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void EMAC_2_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void EMAC_3_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN0_0_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN0_1_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN0_2_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN0_3_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN1_0_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN1_1_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN1_2_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN2_0_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN2_1_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN2_2_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN3_0_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN3_1_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN4_0_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN4_1_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN5_0_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FlexCAN5_1_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void FLEXIO_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPUART0_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART1_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART2_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART3_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART4_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART5_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART6_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART7_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART8_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART9_Handler                              (void) __WEAK __ALIAS("Default_Handler");
void LPUART10_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void LPUART11_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void LPUART12_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void LPUART13_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void LPUART14_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void LPUART15_Handler                             (void) __WEAK __ALIAS("Default_Handler");
void LPI2C0_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPI2C1_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPSPI0_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPSPI1_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPSPI2_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPSPI3_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPSPI4_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPSPI5_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void QSPI_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void SAI0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void SAI1_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void JDC_Handler                                  (void) __WEAK __ALIAS("Default_Handler");
void ADC0_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void ADC1_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void ADC2_Handler                                 (void) __WEAK __ALIAS("Default_Handler");
void LPCMP0_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPCMP1_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void LPCMP2_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void FCCU_0_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void FCCU_1_Handler                               (void) __WEAK __ALIAS("Default_Handler");
void STCU_LBIST_MBIST_Handler                     (void) __WEAK __ALIAS("Default_Handler");
void HSE_MU0_TX_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void HSE_MU0_RX_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void HSE_MU0_ORED_Handler                         (void) __WEAK __ALIAS("Default_Handler");
void HSE_MU1_TX_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void HSE_MU1_RX_Handler                           (void) __WEAK __ALIAS("Default_Handler");
void HSE_MU1_ORED_Handler                         (void) __WEAK __ALIAS("Default_Handler");
void SoC_PLL_Handler                              (void) __WEAK __ALIAS("Default_Handler");



/*----------------------------------------------------------------------------
  Exception / Interrupt Vector table
 *----------------------------------------------------------------------------*/

#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#endif

extern const VECTOR_TABLE_Type __VECTOR_TABLE[NUMBER_OF_INT_VECTORS];
       const VECTOR_TABLE_Type __VECTOR_TABLE[NUMBER_OF_INT_VECTORS] __VECTOR_TABLE_ATTRIBUTE = {
  (VECTOR_TABLE_Type)(&__INITIAL_SP),            /*     Initial Stack Pointer */
  Reset_Handler,                                 /*     Reset Handler */
  NMI_Handler,                                   /* -14 NMI Handler */
  HardFault_Handler,                             /* -13 Hard Fault Handler */
  MemManage_Handler,                             /* -12 MPU Fault Handler */
  BusFault_Handler,                              /* -11 Bus Fault Handler */
  UsageFault_Handler,                            /* -10 Usage Fault Handler */
  RESERVED_Handler,                              /*     Reserved */
  RESERVED_Handler,                              /*     Reserved */
  RESERVED_Handler,                              /*     Reserved */
  RESERVED_Handler,                              /*     Reserved */
  SVC_Handler,                                   /*  -5 SVCall Handler */
  DebugMon_Handler,                              /*  -4 Debug Monitor Handler */
  RESERVED_Handler,                              /*     Reserved */
  PendSV_Handler,                                /*  -2 PendSV Handler */
  SysTick_Handler,                               /*  -1 SysTick Handler */

